/**************
 * 正则相关枚举 *
 **************/

// 正则表达式枚举
export const RegExpEnum = {
  // 手机号
  CELL_PHONE_NUMBER: /^1[34578]\d{9}$/,
  // 密码必须为长度8-20位且包含大小写字母、数字、特殊符号三种及以上组合
  PASSWORD: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*\W)\S{8,20}$/,
  // 中国大陆身份证号码
  ID_CARD: /^[1-9]\d{5}(18|19|20)\d{2}(0[1-9]|1[0-2])(0[1-9]|[12]\d|3[01])\d{3}[0-9Xx]$/,
  // 链接
  URL: /(((^https?:(?:\/\/)?)(?:[-;:&=+$,\w]+@)?[A-Za-z0-9.-]+(?::\d+)?|(?:www.|[-;:&=+$,\w]+@)[A-Za-z0-9.-]+)((?:\/[+~%/.\w-_]*)?\??(?:[-+=&;%@.\w_]*)#?(?:[\w]*))?)$/,
  // 有效数字 允许空
  SIGNIFICANT_FIGURES_NULL: /^-?\d*\.?\d*/,
  // 有效数字 不允许空
  SIGNIFICANT_FIGURES: /^-?\d+(\.\d+)?$/,
} as const
